RSN/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаВебСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>EnumRef.Среда</types>
    </type>
  </attributes>
  <attributes>
    <name>Контур</name>
    <type>
      <types>CatalogRef.Контур</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/ИнформационныеБазы/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкиАвторизации = ИнтеграцияКлиент.ПолучитьНастройкиАвторизации();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормы

 &НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьБазыИзКластера(Команда)                                                           
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	СерверПриложений = ?(ТекДанные = Неопределено, Неопределено, ТекДанные.СерверПриложений);
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораИзКластера", ЭтаФорма);
				
	ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.БазыКластера", Новый Структура("СерверПриложений", СерверПриложений),
		ЭтаФорма,ЭтаФорма.УникальныйИдентификатор,,,ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 

&НаКлиенте
Процедура ЗарегистрироватьОбъекты(Команда)
	
	НастройкиАвторизации = ИнтеграцияКлиент.ПолучитьНастройкиАвторизации();   
	Если Не НастройкиАвторизации.ИспользуетсяАутентификацияОС И Не ЗначениеЗаполнено(НастройкиАвторизации.ИмяПользователя) Тогда   
		ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыАвторизации", ЭтаФорма);
		ОткрытьФорму("Обработка.UniversalMechanisms.Форма.Авторизация",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли; 
	
	ЕстьОшибки = Ложь;	
	СоответсвиеПодключений = ИнтеграцияКлиент.ПолучитьПодключенияПоКонфигурации();
	ЗарегистрироватьОбъектыНаСервере(НастройкиАвторизации, ЕстьОшибки, СоответсвиеПодключений); 
	
	Если Не ЕстьОшибки Тогда
		ПоказатьПредупреждение(,"Все объекты успешно зарегистрированы!");
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокБаз(Команда)
	
	ОповещениеОбработчикРезультата = Новый ОписаниеОповещения("ОбновитьСписокБазРезультат", ЭтотОбъект); 
	
	ДлительнаяОперация = НачатьОбновлениеСпискаБазНаСервере(); 
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);   
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОбработчикРезультата, ПараметрыОжидания); 

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗарегистрироватьОбъектыНаСервере(НастройкиАвторизации, ЕстьОшибки, СоответсвиеПодключений = Неопределено)
	
	СписокБаз = Новый Массив;  
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл
		СписокБаз.Добавить(Новый Структура("ПутьНаВебСервере,Конфигурация", Стр.ПутьНаВебСервере, Стр.Конфигурация));	
	КонецЦикла;
	
	Справочники.ИнформационныеБазы.ЗарегистрироватьОсновныеОбъекты(СписокБаз, НастройкиАвторизации, ЕстьОшибки, СоответсвиеПодключений);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыАвторизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	НастройкиАвторизации = ИнтеграцияКлиент.ПолучитьНастройкиАвторизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбораИзКластера(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ПриЗакрытииФормыПодбораИзКластераНаСервере(Результат);     
	
	Элементы.Список.Обновить();
		
КонецПроцедуры  

&НаСервере
Процедура ПриЗакрытииФормыПодбораИзКластераНаСервере(Результат) 
	
	Справочники.ИнформационныеБазы.ДобавитьБазыВСписок(Результат.СерверПриложений, Результат.ИменаБаз);
	
КонецПроцедуры

&НаСервере
Функция НачатьОбновлениеСпискаБазНаСервере()  
	
	ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияПроцедуры(); 	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыФоновогоЗадания, "Справочники.ИнформационныеБазы.ОбновитьСписокИнформационныхБаз");
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокБазРезультат(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли; 
	
	Элементы.Список.Обновить();

КонецПроцедуры 

#КонецОбласти
